app/controllers/footnotes_controller.rb

  def index
    @footnotes = Footnote.all
---
SELECT "footnotes".* FROM "footnotes"

  def create
    @footnote = @post.footnotes.new(params[:footnote])

    if @footnote.save
---
INSERT INTO "footnotes" ("body", "created_at", "index", "link_text", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def load_post
      @post = Post.find(params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]