app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "body" = 'This is a test post. Lorem [0] ipsum dolor sit amet, massa pellentesque elit elementum lectus. Ante etiam sed facilisis sed. Iaculis [1] pellentesque sed, magna erat dignissim dolor. Senectus et porro odio, phasellus libero nibh id, ligula et vivamus sociosqu cras, nec ut sed gravida quisque dui blandit. Donec eros dui egestas, wisi nibh non aenean ea ultrices, wisi quis viverra sociosqu sollicitudin[2]. Ipsum suspendisse, earum ullamcorper recusandae mauris congue mollis, taciti nascetur, sed lacus enim libero. Nec rutrum in neque euismod nec, in in eu ullamcorper, ligula ipsum aliquet feugiat commodo, suspendisse amet. Nulla sed est sagittis mi ante, montes wisi quisque, wisi wisi magna nec sapien est, quis mauris, velit ipsum. Wisi lorem ut. Vestibulum ut vestibulum posuere condimentum orci in, sodales ac eu, amet ac, turpis blandit feugiat aenean auctor ullamcorper [3]. Aliquam pharetra duis morbi, egestas sagittis ante ullamcorper sollicitudin.', "updated_at" = '2013-02-02 17:01:01.663093' WHERE "posts"."id" = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])